using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace StoneScissorsPaper
{
    internal  class RussianTextMessages : BaseTextMessages
    {
        public override string TextCode { get; } = "Ru";
        public override string GameMenuMessage { get; } =  "\n==============================================================\n" +
                                                           "||                 *****[Игровое меню]*****                 ||\n" +
                                                           "||  -> Для игры введите: [Камень] * [Ножницы] * [Бумага]    ||\n" +
                                                           "||  -> Или введите:      [Очки] * [Назад]                   ||\n" +
                                                           "==============================================================\n" +
                                                           "[Введите выбор ниже]: ";
        public override string OpeningMessage { get; } =   "\n==============================================================\n" +
                                                           "|| *[Добро пожаловать в игру - \"Камень, ножницы, бумага.\"]* ||\n" +
                                                           "|| -> Для продолжения введите команду из списка ниже:       ||\n"+
                                                           "|| -> [Меню] * [Выход] * Or you can change [Language]       ||\n" +
                                                           "==============================================================\n" +
                                                           "[Введите выбор ниже]: ";
        public override string PCWinMessage { get; } =     "==============================================================\n" +
                                                           "||             Увы, вы проиграли в этой баталии.            ||\n" +
                                                           "==============================================================\n";
        public override string UserWinMessage { get; } =   "==============================================================\n" +
                                                           "||              Ура, вы победили в этой битве!              ||\n" +
                                                           "==============================================================\n";
        public override string NobodysWin { get; } =       "==============================================================\n" + 
                                                           "||                          Ничья!                          ||\n" + 
                                                           "==============================================================\n";
        public override string IncorrectInput { get; } = "******* Введено некорректное значение, повторите ввод! *******\n";
        public override string MainMenuMessage { get; } =  "\n==============================================================\n" +
                                                           "||                 *****[Главное меню]*****                 ||\n" +
                                                           "|| -> Для продолжения выберите: [Выход] * [Игра] * [Очки]   ||\n" +
                                                           "==============================================================\n" +
                                                           "[Введите выбор ниже]: ";
        public override string Introducing { get; } =      "\n==============================================================\n" +
                                                           "||Введите свое имя: ";
        public override string GamesScore { get; } = ": cчет побед в играх - ";
        public override string RoundsScore { get; } = ", в раундах - ";




    }
}
